app/controllers/bodies_controller.rb

SELECT "bodies".* FROM "bodies"
---
  def index
    @bodies = Body.all

INSERT INTO "bodies" ("musclename", "img", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["musclename", "MuscleF"], ["img", "MuscleF.png"], ["created_at", "2017-09-17 22:25:20.612447"], ["updated_at", "2017-09-17 22:25:20.612447"]]
---
  def create
    @body = Body.new(body_params)

    if @body.save

UPDATE "bodies" SET "musclename" = $1, "img" = $2, "updated_at" = $3 WHERE "bodies"."id" = $4  [["musclename", "Muscle456"], ["img", "musc456.png"], ["updated_at", "2017-09-18 00:12:42.872701"], ["id", 23]]
---
  def update
    if @body.update(body_params)

DELETE FROM "bodies" WHERE "bodies"."id" = $1  [["id", 19]]
---
  def destroy
    @body.destroy

SELECT  "bodies".* FROM "bodies" WHERE "bodies"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def set_body
      @body = Body.find(params[:id])