app/controllers/exercises_controller.rb

SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @exercise = Exercise.find(params[:id])

INSERT INTO "exercises" ("exercisename", "img", "desc", "created_at", "updated_at", "duration") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["exercisename", "ExerciseB"], ["img", "exerb.png"], ["desc", "exerb desc"], ["created_at", "2017-09-17 22:25:48.344765"], ["updated_at", "2017-09-17 22:25:48.344765"], ["duration", 1]]
---
  def create
    @exercise = Exercise.new(exercise_params)

    if @exercise.save

UPDATE "exercises" SET "exercisename" = $1, "img" = $2, "updated_at" = $3 WHERE "exercises"."id" = $4  [["exercisename", "ExerciseC"], ["img", "exerc.png"], ["updated_at", "2017-09-18 00:21:49.461851"], ["id", 18]]
---
  def update
    if @exercise.update(exercise_params)

DELETE FROM "exercises" WHERE "exercises"."id" = $1  [["id", 16]]
---
  def destroy
    @exercise.destroy

SELECT  "exercises".* FROM "exercises" WHERE "exercises"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
    def set_exercise
      @exercise = Exercise.find(params[:id])