app/controllers/groups_controller.rb

INSERT INTO "groups" ("body_id", "exercise_id", "groupname", "created_at", "updated_at", "muscle_group_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["body_id", 3], ["exercise_id", 2], ["groupname", "Legs"], ["created_at", "2017-09-20 11:50:57.036543"], ["updated_at", "2017-09-20 11:50:57.036543"], ["muscle_group_id", 2]]
---
  def create
    @group = Group.new(group_params)

    if @group.save