app/controllers/muscles_controller.rb

  def index
    @muscles = Muscle.all
---
SELECT "muscles".* FROM "muscles"