app/controllers/muscle_groups_controller.rb

SELECT "groups".* FROM "groups" WHERE "groups"."muscle_group_id" = $1  [["muscle_group_id", 1]]
SELECT "muscle_groups".* FROM "muscle_groups"
---
  def index
    @muscle_groups = MuscleGroup.all